app/controllers/comments_controller.rb

SELECT * FROM `comments` WHERE (`comments`.post_id = 5)
---
  def index
    @comments = @post.comments.all

SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM `comments` WHERE (`comments`.`id` = 4)
---
  def edit
    @comment = Comment.find(params[:id])

INSERT INTO `comments` (`updated_at`, `body`, `post_id`, `user_id`, `created_at`) VALUES('2009-05-19 08:41:34', 'gasdgasdgasdgasdgasdg', 8, 1, '2009-05-19 08:41:34')
---
  def create
    @comment = @post.comments.new(params[:comment])
    #update user_id
    @comment.user_id = current_user.id
    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 6)
DELETE FROM `comments` WHERE `id` = 6
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
---
  def load_post
    @post = Post.find(params[:post_id])