app/controllers/posts_controller.rb

  def index
    @posts = Post.all :order => "created_at DESC"
---
SELECT * FROM `posts` WHERE (`posts`.user_id = 2)

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)

  def create
    @post = current_user.posts.build(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-05-18 09:27:21', 'tin test', 'tint test\r\n', '2009-05-18 09:27:21')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
UPDATE `posts` SET `body` = 'hsdfh sdgasdga shashashasdh adfhasdfh', `updated_at` = '2009-05-18 11:38:55' WHERE `id` = 2

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
DELETE FROM `posts` WHERE `id` = 3