app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('027c40e3b5483e5f8b31cf14146b1cd2f2642266', '2009-05-18 08:19:58', NULL, '01cd8a5806dd4ecc45158f9381d183df43db5586', NULL, '1746e639824c206f1cdd378240c7fcd9ff485138', NULL, 'tintn', 'tintn.hcmute@gmail.com', '2009-05-18 08:19:58')

  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = '1746e639824c206f1cdd378240c7fcd9ff485138') LIMIT 1